#include "TeluguDict.h"

// అచ్చులు
// 	అ	ఆ	ఇ	ఈ	ఉ	ఊ
// 	ఋ	ౠ	ఌ	ౡ
// 	ఎ	ఏ	ఐ
// 	ఒ	ఓ	ఔ
// ఉభయాక్షరమలు
// 	ఁ	ం	ః

// హల్లులు
// 	క	ఖ	గ	ఘ	ఙ
// 	చ	ఛ	జ	ఝ	ఞ
// 	ట	ఠ	డ	ఢ	ణ
// 	త	థ	ద	ధ	న
// 	ప	ఫ	బ	భ	మ
// 	య	ర	ల	వ
// 	శ	ష	స	హ
// 	ళ	ఱ	క్ష
// 	ౘ	ౙ
// చిహ్నములు
// 	ఽ

static void setupAchulu(TeluguDict &lut) {
	// అచ్చులు
	A("అ", 0x006E);	A("ఆ", 0x00C4);		A("ఇ", 0x00C7);	A("ఈ", 0x00E1);	   A("ఉ", 0x00F1);	A("ఊ", 0x007D);
	SK("", 0xA1);	D("ా", 0xB1);		D("ి", 0xE6);	D("ీ", 0xB0);		D("ు", 0x54);	D("ూ", 0x4C);
	SK("", 0xA3);	D("ా", 0xCA);		D("ి", 0xE7);	D("ీ", 0xFB);		D("ు", 0xDF);	D("ూ", 0x4F);
	SK("", 0xAF);	D("ా", 0xD5);		D("ి", 0xCF);	D("ీ", 0x201D);		D("ు", 0xEE);	D("ూ", 0x50);
	SK("", 0xB7);	D("ా", 0xDC);											D("ు", 0xF3);	D("ూ", 0x53);
	SK("", 0xC9);	D("ా", 0xEA);											D("ు", 0x2044);	D("ూ", 0xF7);
	SK("", 0xD1);	D("ా", 0xEB);											D("ు", 0x51);	D("ూ", 0x41);
	SK("", 0xE4);	D("ా", 0x2264);
	SK("", 0xFC);

	A("ఋ", 0x0000);	A("ౠ", 0x0000);	A("ఌ", 0x0000);	A("ౡ", 0x0000);
	D("ృ", 0x00E8);	D("ౄ", 0x0000);

	A("ఎ", 0x0000);	A("ఏ", 0x0040);	A("ఐ", 0x0004);
	D("ె", 0xAC);	D("ే", 0xD2);	D("ై", 0x2019);
	D("ె", 0xCB);	D("ే", 0xF9);	D("ై", 0x2206);
	D("ె", 0xD3);	D("ే", 0x03C0);
	D("ె", 0xF4);	D("ే", 0x201A);
	D("ె", 0x2026);	D("ే", 0x02DA);

	A("ఒ", 0x0000);		A("ఓ", 0x007A);		A("ఔ", 0x0000);
	D("ొ", 0x3D);		D("ో", 0xC0);		D("ౌ", 0xC2);
	D("ొ", 0xA7);		D("ో", 0x02DB);		D("ౌ", 0xD6);
	D("ొ", 0x131);		D("ో", 0x2218);		D("ౌ", 0xDA);
						D("ో", 0x221A);		D("ౌ", 0xF6);

	// ఉభయాక్షరమలు
	S("ఁ", 0x0000);	S("ం", 0x002B);	S("ః", 0x0000);

	// D("ౕ", );	D("ౖ", );	D("ౢ", );	D("ౣ", );	D("ఀ", );
}

static void setupHallulu(TeluguDict &lut) {
	A("క",  0x2248);	 A("ఖ", 0x4B);		A("గ",  0x3E);
	A("క",  0xF8);		 A("ఖ", 0x55);
	V("్క", 0xFF);		V("్ఖ",  0xE2);		V("్గ",  0x5A);		V("్ఘ", 0xC8);

	A("చ", 0x23);		A("జ", 0x43);
						A("జ", 0xBB);
	V("్చ", 0xC3);		V("్జ",  0xAE);								V("్ఞ", 0x201E);

	A("ట", 0x66);		A("డ", 0x26);		A("ణ", 0x44);
	A("ట", 0x7B);
	A("ట", 0x2265);
	V("్ట",  0xBA);			V("్ఠ", 0x02DC);	V("్డ",  0xB6);		V("్ణ",  0xED);

	A("త", 0x84);							A("ద",  0x3C);							A("న", 0x48);
	A("త", 0x2018);																	A("న", 0x71);
	V("్త",  0xD4);			V("్థ",  0xFA);		V("్ద", 0x203A);	V("్ధ", 0x0394);	V("్న", 0xEF);

	A("ప", 0x7C);								A("బ", 0x75);
	A("ప", 0x62);								A("బ", 0xE3);
	A("వ", 0x6D);
							V("్ప", 0x0152);	V("్బ", 0x201C);					V("్మ", 0xE0);
																					V("్శ", 0xD9);


	A("య", 0x6A);		A("ర", 0x73);		A("ల", 0x5C);		A("వ", 0x65);
											 A("ల", 0x2DD);		 A("వ", 0x79);
	V("్య",  0xB4);		 V("్ర", 0xC5);		V("్ల",  0xA2);			V("్వ", 0xAB); 
											
	A("శ",  0x58);		A("ష", 0x63);		A("స", 0x64);		A("హ", 0x56);
						A("ష", 0xB8);		A("స", 0x6B);
						A("ష", 0x77);
						V("్ష",  0xE5);		V("్స", 0x2021);		V("్హ", 0x03A9);
	
	A("ళ",  0xFB01);

	// convert to vothu
	V(".", 0xA4); // Chinna vothu
	V(".", 0xDB); // Aksharam vothu

	// // హల్లులు
	// H("క", 0x2248);		H("ఖ", 0x4B);		H("గ", 0x003E);		H("ఘ", 0x0000);		H("ఙ", 0x0000);
	// H("క", 0x00F8);		H("ఖ", 0x55);
	// V("్క", 0x00FF);	V("్ఖ", 0x00E2);	 V("్గ", 0x005A);	  V("్ఘ", 0x00C8);		V("్ఙ", 0x0000);

	// H("చ", 0x0023);		H("ఛ", 0x0000);		H("జ", 0x0043);		H("ఝ", 0x0000);		H("ఞ", 0x0152);
	// H("చ", 0x0000);							H("జ", 0x00BB);
	// V("్చ", 0x00C3);	V("్ఛ", 0x0000);	 V("్జ", 0x00AE);	   V("్ఝ", 0x0000);		V("్ఞ", 0x0000);

	// H("ట", 0x0066);		H("ఠ", 0x0000);		H("డ", 0x0026);		H("ఢ", 0x0000);		H("ణ", 0x0044);
	// H("ట", 0x007B);
	// V("్ట", 0x00ba);	V("్ఠ", 0x0000);		V("్డ", 0x00b6);	V("్ఢ", 0x0000);	V("్ణ", 0x00ED);

	// H("త", 0x0000);		H("థ", 0x0000);		H("ద", 0x003C);		H("ధ", 0x0000);		H("న", 0x0048);
	// 																				 H("న", 0x0071);
	// V("్త", 0x00D4);	V("్థ", 0x00FA);		V("్ద", 0x2030);	V("్ధ", 0x000A);	V("్న", 0x00EF);
	// 																				V("్న", 0x2022);

	// H("ప", 0x0062);		H("ఫ", 0x0000);		H("బ", 0x00E3);		H("భ", 0x0000);		H("మ", 0x0000);
	// H("ప", 0x006D);							H("బ", 0x0000);		H("భ", 0x0000);		H("మ", 0x0000);
	// H("ప", 0x0056);
	// H("ప", 0x0079);
	// H("ప", 0x007C);
	// V("్ప", 0x2013);	V("్ఫ", 0x0000);	V("్బ", 0x0075);	V("్భ", 0x0000);	V("్మ", 0x00E0);

	// // ----

	// H("య", 0x006A);		H("ర", 0x0073);		H("ల", 0x005C);		H("వ", 0x0065);
	// V("్య", 0x00B4);	V("్ర", 0x00C5);	V("్ల", 0x00A2);	V("్వ", 0x00AB);

	// H("శ", 0x0058);		H("ష", 0x0077);		H("స", 0x0064);		H("హ", 0x0000);
	// 					H("ష", 0x0063);		H("స", 0x006B);
	// V("్శ", 0x00D9);	V("్ష", 0x00B8);	V("్స", 0x201A);	V("్హ", 0x000D);

	// H("ళ", 0x201C);		H("ఱ", 0x0000);		   H("క్ష", 0x0000);
	// V("్ళ", 0x0000);	V("్ఱ", 0x0000);

	// H("ౘ", 0x0000);		H("ౙ", 0x0000);

	// చిహ్నములు
	H("ఽ", 0x0000);

	//  skip ్
	H("్", 0x59);
	H("్", 0x74);
	H("్", 0xE9);
	H("్", 0x0178);
	H("్", 0x02D8);

	// convert to vothu
	V(".", 0x0000); // Aksharam vothu
	V(".", 0x0000); // Chinna vothu
}

static void setupTeluguVarnamala(TeluguDict &lut) {
	setupAchulu(lut);
	setupHallulu(lut);
}

static void setupAksharamlu(TeluguDict &lut) {
	AK("గి", 0x2013);	AK("గీ", 0x5E);
	AK("చి", 0x222B);	AK("చీ", 0x4E);
	AK("జి", 0xF5);		AK("జీ", 0x4A);		AK("జు", 0x45);		AK("జూ", 0x70);
	AK("తీ", 0x72);		AK("తీ", 0x2039);
	AK("ది", 0x7E);		AK("దీ", 0x42);
	AK("ని", 0xEC);		AK("నీ", 0x02D9);
	AK("బి", 0x5F);		AK("బీ", 0x3B);
	AK("రి", 0x5D);		AK("రీ", 0xD8);
	AK("లి", 0x2A);
	AK("వి", 0x24);		AK("వీ", 0x4D);
	AK("ళి", 0x5B);		AK("ళీ", 0x221E);

	AK("శి", 0x2022);
	AK("శ్రీ", 0x6C);
	AK("స్త్ర", 0x67);

	// AK("గి", 0x2026);	AK("గీ", 0x005E);
	// AK("చి", 0x0006);	AK("చీ", 0x004E);
	// AK("జి", 0x00F5);	AK("జి", 0x203A);	AK("జీ", 0x004A);	AK("జు", 0x0045);	AK("జూ", 0x0070);
	// AK("ది", 0x007E);	AK("దీ", 0x0042);
	// AK("తి", 0x02C6);	AK("తీ", 0x0072);
	// AK("ని", 0x00EC);	AK("నీ", 0x0000);
	// AK("బి", 0x005F);	AK("బీ", 0x003B);
	// AK("రి", 0x005D);	AK("రీ", 0x00D8);
	// AK("లి", 0x002A);	AK("లీ", 0x002A);
	// AK("వి", 0x0024);	AK("వీ", 0x004D);
	// AK("ళీ", 0x006F);	AK("ళీ", 0x000C);

	// AK("శి", 0x005B);
	AK("క్ష్మ", 0x0000); // Fix it
}

void setupSpecial(TeluguDict &lut) {
	SP("0", 0x0030);	SP("1", 0x0031);	SP("2", 0x0032);	SP("3", 0x0033);	SP("4", 0x0034);
	SP("5", 0x0035);	SP("6", 0x0036);	SP("7", 0x0037);	SP("8", 0x0038);	SP("9", 0x0039);

	SP(".", 0x192);		SP(".", 0x2E);		SP(".", 0xF2);		SP(":", 0x220F);	SP(":", 0x3A);
	SP("?", 0x3F);		SP("|", 0x02C6);	SP("!", 0x21);		SP("(", 0x28); SP(")", 0x29);

	SP("-", 0x60);	SP(",", 0x3BC);	SP(",", 0x2C);

	SP(" ", 0x20);	SP(" ", 0x7F);	SP(" ", 0xA0);
}

void setupFontLUT(TeluguDict &lut) {
	lut.clear();

	setupTeluguVarnamala(lut);
	setupAksharamlu(lut);
	setupSpecial(lut);
}